[Killed] BlockStatement
src/Roller.ts:8:24
 
 
     //getter for faces for testing constructor
-    getFaces(): number {
-        return this._faces;
-    }
+    getFaces(): number {}
 
     // specifies the number of faces the die has. It must have at least 2 faces
killedBy: Roller tests Roller with 6 faces(Happy flow) constructor)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] BlockStatement
src/Roller.ts:15:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        if (faces < 2) {
-            this._faces = 6;
-        } else {
-            this._faces = faces;
-        }
-        this._last = 0;
-        this._distribution = new Map<number, number>();
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 
killedBy: Roller tests Roller with 6 faces(Happy flow) constructor)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] BlockStatement
src/Roller.ts:16:24
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        if (faces < 2) {
-            this._faces = 6;
-        } else {
+        if (faces < 2) {} else {
             this._faces = faces;
         }
killedBy: Roller tests Roller with 1 face(Sad flow) constructor)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] BlockStatement
src/Roller.ts:35:33
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number {
-        if (value < 1 || value > this._faces) {
-            return 0;
-        }
-
-        this._last = value;
-
-        let temp: number = this._distribution.get(value);
-        if (temp) {
-            this._distribution.set(value, temp+1);
-        } else {
-            this._distribution.set(value, 1);
-        }
-
-        return value;
-    }
+    roll(value: number): number {}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller tests Roll with 2 number (Happy flow) for roll function expect 2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ConditionalExpression
src/Roller.ts:43:13
         this._last = value;
 
         let temp: number = this._distribution.get(value);
-        if (temp) {
+        if (true) {
             this._distribution.set(value, temp+1);
         } else {
killedBy: Roller tests Return a Map object with keys from 1 to the number of faces and values of no. of rolls after some valid rolls
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Map {
-   1 => 1,
-   2 => 1,

[Survived] ConditionalExpression
src/Roller.ts:43:13
         this._last = value;
 
         let temp: number = this._distribution.get(value);
-        if (temp) {
+        if (false) {
             this._distribution.set(value, temp+1);
         } else {

[NoCoverage] ArithmeticOperator
src/Roller.ts:44:43
 
         let temp: number = this._distribution.get(value);
         if (temp) {
-            this._distribution.set(value, temp+1);
+            this._distribution.set(value, temp - 1);
         } else {
             this._distribution.set(value, 1);

[Killed] BlockStatement
src/Roller.ts:45:16
         let temp: number = this._distribution.get(value);
         if (temp) {
             this._distribution.set(value, temp+1);
-        } else {
-            this._distribution.set(value, 1);
-        }
+        } else {}
 
         return value;
killedBy: Roller tests Return a Map object with keys from 1 to the number of faces and values of no. of rolls after some valid rolls
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Map {
-   1 => 1,
-   2 => 1,

[Killed] BlockStatement
src/Roller.ts:63:41
     // value and its value should be the number of times that face has been
     // rolled. Even if a face has not yet been rolled, its key should have a
     // value of 0.
-    distribution(): Map<number, number> {
-        const map = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
-            let temp: number = this._distribution.get(i);
-            map.set(i, temp || 0);
-        }
-        return map;
-    }
+    distribution(): Map<number, number> {}
 } // end of Roller class
killedBy: Roller tests Return a Map object with keys from 1 to the number of faces and values of 0 if no rolls have been made yet
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: Map {1 => 0, 2 => 0, 3 => 0, 4 => 0, 5 => 0, 6 => 0}
Received: undefined

[Killed] EqualityOperator
src/Roller.ts:65:25
     // value of 0.
     distribution(): Map<number, number> {
         const map = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
+        for (let i = 1; i < this._faces; i++) {
             let temp: number = this._distribution.get(i);
             map.set(i, temp || 0);
killedBy: Roller tests Return a Map object with keys from 1 to the number of faces and values of 0 if no rolls have been made yet
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

@@ -2,7 +2,6 @@
    1 => 0,
    2 => 0,

[Killed] EqualityOperator
src/Roller.ts:65:25
     // value of 0.
     distribution(): Map<number, number> {
         const map = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
+        for (let i = 1; i > this._faces; i++) {
             let temp: number = this._distribution.get(i);
             map.set(i, temp || 0);
killedBy: Roller tests Return a Map object with keys from 1 to the number of faces and values of 0 if no rolls have been made yet
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Map {
-   1 => 0,
-   2 => 0,

[Killed] ConditionalExpression
src/Roller.ts:67:24
         const map = new Map<number, number>();
         for (let i = 1; i <= this._faces; i++) {
             let temp: number = this._distribution.get(i);
-            map.set(i, temp || 0);
+            map.set(i, false);
         }
         return map;
killedBy: Roller tests Return a Map object with keys from 1 to the number of faces and values of 0 if no rolls have been made yet
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Map {
-   1 => 0,
-   2 => 0,

[Killed] ConditionalExpression
src/Roller.ts:67:24
         const map = new Map<number, number>();
         for (let i = 1; i <= this._faces; i++) {
             let temp: number = this._distribution.get(i);
-            map.set(i, temp || 0);
+            map.set(i, true);
         }
         return map;
killedBy: Roller tests Return a Map object with keys from 1 to the number of faces and values of 0 if no rolls have been made yet
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Map {
-   1 => 0,
-   2 => 0,
